#Текст первого приветствия
text_1_greating = """
Привет👋, {user_first_name}!
🚀 Выберите действие:
Сделал так, чтобы было разное количество кнопок, если клиент еще не покупал у нас ключ и если он купил.
Нужно придумать вариант, чтобы поддержка шла не на мой личный аккаунт.
ТЕКСТ!
"""[1:]
# Если отказ принять пользовательское соглашение:
if_otkaz_polz = "✋ Пожалуйста, сначала ознакомьтесь с соглашением об использовании!"



# Кнопки главного меню
button_check_payment = "🔵 Проверить оплату"
button_my_key = "🔵 Мой ключ"
button_my_stats = "🔵 Моя статистика"
button_tariff_plan = "📋 Тарифный план"
button_partnership = "🤝 Партнерство"
button_user_agreement = "📜 Соглашение об использовании"
button_support = "💎 Поддержка"

# Другие тексты (если нужны)
text_about = "Этот бот создан для демонстрации красивой структуры кода! 🚀"
text_settings = "Здесь будут настройки пользователя! ⚙️"


# Пользовательское соглашение
USER_AGREEMENT_TEXT = """
<b>Соглашение об использовании</b>

Пользуясь этим ботом, вы соглашаетесь со следующими условиями:
- Бот предоставляется "как есть" без каких-либо гарантий.
- Пользователь несёт ответственность за соблюдение законодательства своей страны.
- Администрация не несет ответственности за возможные потери данных.

Нажимая "Ознакомился", вы подтверждаете принятие условий.
"""[1:]
declaration_if_not_excepted = "✋ Для доступа к полному функционалу бота, пожалуйста, сначала ознакомьтесь с соглашением об использовании!"